# -*- mode: ruby; -*-

# Install with:
#
# $ brew tap Homebrew/bundle
# $ brew bundle

tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Shell
brew 'zsh'
brew 'coreutils'                # To have GNU tools at hand in need
brew 'findutils'
brew 'tree'
brew 'autojump'

# Tools
brew 'wget'
brew 'homebrew/dupes/rsync'     # The built-in versions is horribly dated
brew 'imagemagick'              # Command line image manipulation
brew 'optipng'                  # PNG optimisation
brew 'mupdf-tools'              # Command line PDF tools
brew 'youtube-dl'               # Youtube Downloader
brew 'pandoc'                   # Markdown converting reloaded

# Dotfile management
brew 'stow'

# Development tools
brew 'git'
brew 'xctool'                   # Build tool for XCode projects
brew 'the_silver_searcher'      # Code search
brew 'shellcheck'               # Shell script linting

# Github frontends
brew 'gist'
brew 'hub'

# Languages
brew 'python'
brew 'pyqt'                     # For jupyter qtconsole
brew 'ruby'
brew 'rust'
brew 'haskell-stack'
brew 'sbt'                      # Scala
brew 'node'                     # Javascript (sad, but necessary)
brew 'coq'

# Emacs
brew 'trash'                    # Command line trashing, used by Emacs
brew 'texinfo'
brew 'aspell', args: ['with-lang-de', 'with-lang-en']
brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'with-librsvg', 'HEAD']
