# -*- mode: ruby; -*-

# Install with:
#
# $ brew tap Homebrew/bundle
# $ brew bundle

tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Shell
brew 'zsh'
brew 'tmux'                     # Terminal multiplexer
brew 'tree'                     # Directory tree printer
brew 'autojump'                 # Fast directory jumping for Zsh
brew 'thefuck'                  # Fuck the last command
brew 'coreutils'                # To have GNU tools at hand in need
brew 'findutils'
brew 'gnu-sed'

# Tools
brew 'homebrew/dupes/less'      # The built-in less is horribly outdated
brew 'homebrew/dupes/rsync'     # rsync, likewise...
brew 'httpie'                   # Powerful http client
brew 'youtube-dl'               # Youtube Downloader

# Documents and images
brew 'pandoc'                   # Markdown converting reloaded
brew 'mupdf-tools'              # Command line PDF tools
brew 'ghostscript'              # For LaTeXIT and MacTeX
brew 'imagemagick'              # Command line image manipulation
brew 'optipng'                  # PNG optimisation

# Dotfile management
brew 'stow'

# Development tools
brew 'git'
brew 'xctool'                   # Build tool for XCode projects
brew 'the_silver_searcher'      # Code search
brew 'the_platinum_searcher'    # Also code search :)
brew 'shellcheck'               # Shell script linting
brew 'ansible'                  # Worst provisioning system ever :(
brew 'cloc'                     # Count code lines
brew 'redis'                    # Redis client

# Github frontends
brew 'gist'
brew 'hub'

# Languages
brew 'python'
brew 'pyqt'                     # For jupyter qtconsole
brew 'ruby'
brew 'rust'
brew 'haskell-stack'            # Haskell stack
brew 'maven'                    # Java
brew 'sbt'                      # Scala
brew 'scalastyle'
brew 'node'                     # Javascript (sad, but necessary)
brew 'coq'

# Emacs
tap 'railwaycat/emacsmacport'   # Emacs Mac port
brew 'emacs-mac'
brew 'trash'                    # Command line trashing, used by Emacs
brew 'texinfo'
brew 'aspell', args: ['with-lang-de', 'with-lang-en']
# brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'with-librsvg', 'HEAD']
